<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Selecting Data with Pandas: _Masking_

_Authors: Dave Yerrington (SF)_

In [2]:
import pandas as pd

### Basic Data Example

In [3]:
data = [
    (4, 100, "Car"),
    (2, 150, "Bicycle"),
    (10, 1000, "Bicycle"),
    (15, 1500, "Car"),
]

df = pd.DataFrame(data, columns=["Hour", "Events", "Category"])
df

   Hour  Events Category
0     4     100      Car
1     2     150  Bicycle
2    10    1000  Bicycle
3    15    1500      Car

### Selecting only values within "Hour" greater than 9

In [4]:
df[ df['Hour'] > 9]

   Hour  Events Category
2    10    1000  Bicycle
3    15    1500      Car

### How does this work exactly?
When we specify the condition `df['Hour'] > 9`, that actually creates a `boolean series` (or you can also think of it as a boolean vector).  Every offset of that boolean vector cooresponds to each row (axis 0).  Anything with a value of `False`, cooresponds to the condition specified for that row.

In the first 2 rows, the **"Hour"** does not meet the condition, **`> 9`**, so the row indexes for those rows within the `boolean series`, are `False`.

<img src="./assets/images/dfmask_hour.png" width=700 align="center" />

In [5]:
my_mask = df['Hour'] > 9
my_mask

0    False
1    False
2     True
3     True
Name: Hour, dtype: bool

In [6]:
df[my_mask]

   Hour  Events Category
2    10    1000  Bicycle
3    15    1500      Car

<img src="./assets/images/dfmask_category.png" width=700 align="center" />

In [7]:
car_mask = df['Category'] == "Car"
car_mask

0     True
1    False
2    False
3     True
Name: Category, dtype: bool

In [8]:
df[car_mask]

   Hour  Events Category
0     4     100      Car
3    15    1500      Car

### Masking operators
Selecting the opposite (not "Car")

In [9]:
df[~car_mask]

   Hour  Events Category
1     2     150  Bicycle
2    10    1000  Bicycle

Multiple conditions.

"and" ie: &

In [10]:
df[(df['Events'] > 150) & (df['Hour'] < 15)]

   Hour  Events Category
2    10    1000  Bicycle

"or" ie: |

In [11]:
df[(df['Events'] > 150) | (df['Hour'] > 15)]

   Hour  Events Category
2    10    1000  Bicycle
3    15    1500      Car

#### Built-in functions
`series.isin([list])` is handy for checking if a series value equals any list of values.

In [12]:
df[ df['Hour'].isin([4, 15]) ]

   Hour  Events Category
0     4     100      Car
3    15    1500      Car

For a full list of functions that work with seris, which can be used for testing truth values of your series data, check out [the docs](https://pandas.pydata.org/pandas-docs/stable/api.html#series).

### Experimantal `query` features available since Pandas v.13

A pretty cool, yet not yet stable feature in Pandas, is the [`query()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.query.html#pandas.DataFrame.query) function.  It can help clean up long conditional statements between your brackets.  We've found it's not always reliable but it can be a handy method to use for quick access to your data.

In [13]:
df.query("Hour > 9")

   Hour  Events Category
2    10    1000  Bicycle
3    15    1500      Car

In [14]:
df.query("Hour > 9 & Category == 'Bicycle'")

   Hour  Events Category
2    10    1000  Bicycle